<<<<<<< HEAD
[{"date":"Feb 11, 2015","imageSrc":"Images/SAB_page_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/stuffabear2015","headline":"Stuff-A-Bear","previewText":"Molloy Student Government hosted its annual Stuff-a-Bear giveaway on Tuesday, Feb 10 in the Public Square Lobby"},{"date":"Feb 11, 2015","imageSrc":"Images/PP2015_article_thumb.jpg","storyLink":"molloy-life/molloy-life-news/pp2015","headline":"Partner Project : A Private Violence","previewText":"Over 560 people filled the Madison Theatre on January 29th for the Partner Project’s Second Annual Conference."},{"date":"Feb 11, 2015","imageSrc":"Images/Snow15_page_thumbnail(0).jpg","storyLink":"molloy-life/molloy-life-news/snow2015","headline":"First Major Snowfall of 2015","previewText":"Soundly asleep, dreaming of the best of things, the Molloy community became all too familiar with the dreaded 6:45am phone call, warning staff, students, and faculty about the cancellation of classes."},{"date":"Jan 29, 2015","imageSrc":"Images/ProjAlm_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/projectalmanac","headline":"First Look: Project Almanac","previewText":"If you are into sci-fi time travel movies and stories, such as Back to the Future or Steins;Gate, you will easily fall in love with Project Almanac."},{"date":"Jan 29, 2015","imageSrc":"Images/SienaBC_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/sienabookclub","headline":"The Siena Women&#39;s Center Book Club","previewText":"Since its first meeting discussing the worldwide bestselling novel &quot;The Da Vinci Code,&quot; by Dan Brown, the Siena Women&#39;s Center book club has been a success for over seven years."},{"date":"Jan 20, 2015","imageSrc":"Images/BuzzerBeater_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/gamewinningliupost","headline":"Game-Winning, Buzzer-Beating Layup vs. LIU Post","previewText":"Watch Molloy College&#39;s  game-winning, buzzer-beating layup to help the Lions defeat East Coast Conference-foe LIU Post."},{"date":"Jan 14, 2015","imageSrc":"Images/HoF2015_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/halloffame2015","headline":"Athletics Hall of Fame 2015","previewText":"This past Friday evening, the Molloy College Department of Athletics honored four individuals by inducting them into the Molloy Athletic Hall of Fame at the Milleridge Cottage in Jericho, Long Island. Donna Lohrey Classie &#39;06 (Women&#39;s Basketball, 2002-06), Lauren Catania Daly &#39;05 (Women&#39;s Soccer, 2000-03),Joe Holden (Baseball, 2003-05) and Ettore Morelli &#39;09 (Men&#39;s Soccer, 2004-08) joined the ranks of Molloy Athletics&#39; most impressive and successful."},{"date":"Jan 12, 2015","imageSrc":"Images/NightOut_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/eccnightoutonthelion","headline":"ECC Night Out On The Lion","previewText":"Before the Christmas holiday, Molloy College Athletics hosted the 2nd Annual &quot;Night Out On The Lion&quot; event as part of a conference-wide community initiative. The event allowed parents the opportunity to have an evening out after dropping off their children in a fun environment with activities run by student-athletes. A photo gallery and video highlight reel are available at the links above."},{"date":"Dec 11, 2014","imageSrc":"Images/santasworkshop_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/santasworkshop","headline":"Families flock to Santa&#39;s Workshop!","previewText":"The holiday spirit filled the Public Square lobby when Santa Clause made a special visit to Molloy College by spreading joy at the annual Santa’s Workshop event on Dec 6."},{"date":"Dec 11, 2014","imageSrc":"Images/IraqStory_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/iraqfamilies","headline":"Molloy pitches in to help displaced Iraqi families.","previewText":"Eleven years later, Iraq is still immersed in turmoil, destitution, and chaos. In these hard times that the Iraqi people face, the Dominican Tradition of Molloy College (Mission Integration and Campus Ministries) came together to raise over $4,000 for Sister Maria Hanna, of the Dominican Sisters of St. Catherine of Siena, Iraq, in October."},{"date":"Dec 11, 2014","imageSrc":"Images/BITD_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/breakfastinthedark","headline":"Breakfast In The Dark","previewText":"The third annual Breakfast in in the Dark event, hosted by LEAD Club, Club TRiO, and the Social Work Club, was a success as over a hundred participants ate their meals blind folded and in the dark on Tuesday, Dec 2 at the Hayes Theater."},{"date":"Dec 02, 2014","storyLink":"molloy-life/molloy-life-news/anselmagrandopening","headline":"Anselma Room Grand Opening!","previewText":"A DJ and party lights lit up the revitalized Anselma Room as Molloy celebrated its grand opening.  While officially open for business on Sunday, November 30th, that Monday played host to a party for the occasion."},{"date":"Dec 02, 2014","imageSrc":"Images/articlethumb.jpg","storyLink":"molloy-life/molloy-life-news/mrmolloy","headline":"Mr. Molloy 2014","previewText":"Talent and style shined bright as Michael Goldin became the first freshman ever crowned Mr. Molloy.  Sponsored by the Senior Class of MSG, Mr. Molloy was host to ten students competing for the coveted title on the night of November 20th in the Madison Theatre."},{"date":"Nov 13, 2014","imageSrc":"Images/careerfair_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/careerfair","headline":"Career Fair helps students fulfill their passions","previewText":"On Oct 30, the Career Development Center held their annual Career Fair in the Multipurpose Room."},{"date":"Nov 13, 2014","imageSrc":"Images/coffee_large.jpg","storyLink":"molloy-life/molloy-life-news/coffeehouse","headline":"Music Therapy Coffee House","previewText":"On October 28th 2014, Molloy’s Music Therapy Club held it’s fall Coffee House event."},{"date":"Nov 13, 2014","imageSrc":"Images/VD14_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/veteransday","headline":"Veteran&#39;s Day: A Time To Admire","previewText":"Veterans Day is a time to admire, respect, and show gratitude to American veteran’s for their love of country, patriotism, and devotion to serve and sacrifice for the common good."},{"date":"Nov 13, 2014","imageSrc":"Images/halloween_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/halloween2014","headline":"Halloween Party!","previewText":"There is no question that one of the largest events on campus is the annual Halloween Party"},{"date":"Oct 29, 2014","imageSrc":"Images/haunted_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/hauntedmansion","headline":"Haunted Mansion at Hays Theatre","previewText":"On the nights of October 24th and 25th, crowds lined up in the Wilbur Lobby to enter the Haunted Mansion in the Hays Theatre. This event was sponsored by the Molloy Performing Arts Club and co-sponsored by the ASL Club."},{"date":"Oct 29, 2014","imageSrc":"Images/StudentDinner_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/studentdinner","headline":"Staff Sponsored Student Dinner","previewText":"Residents of Maria Regina Hall and Fitzgerald Hall were in for a surprise as staff at Molloy College provided dinner and dessert for 257 students on Oct 20 at both buildings."},{"date":"Oct 23, 2014","imageSrc":"Images/Hcoming2014_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/homecoming2014","headline":"Homecoming Weekend","previewText":"Molloy College’s Homecoming weekend is about meshing the past with the present to create a better future"},{"date":"Oct 22, 2014","imageSrc":"Images/MM2014_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/maroonmadness2014","headline":"Maroon Madness 2014","previewText":"Maroon Madness kicked off the opening of the 2014-15 men’s and women’s basketball season on Oct 16 at the Quealy Gymnasium in Wilbur with almost 1,000 spectators in the stands"},{"date":"Oct 22, 2014","imageSrc":"Images/CDB_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/conversationwithdrdrew","headline":"Dr. Bogner Goes on Listening Tour of Campus","previewText":"While students at most other colleges may never get to interact with their school’s president, Dr. Drew Bogner, President of Molloy College, has set a different tone in an attempt to open a dialogue with students on campus"},{"date":"Oct 17, 2014","imageSrc":"Images/molloylife/IS_Speaker_thumb.jpg","storyLink":"molloy-life/molloy-life-news/investment-speaker","headline":"Investment Club Featured Speaker","previewText":"On Wednesday, October 1, the Investment Club hosted Philip Roth, a retired Chartered Market Technician, as a guest speaker in the Public Square Multipurpose Room"},{"date":"Oct 07, 2014","imageSrc":"Images/molloylife/ppsmall(0).jpg","storyLink":"molloy-life/molloy-life-news/club-spotlight-pp","headline":"Spotlight: Break the Silence Club","previewText":"A little less than two years ago, a student came to the office of Teresa Aprigliano, Associate Dean and Director of the Division of Nursing, seeking help as her personal life was being affected by relationship violence."},{"date":"Oct 02, 2014","storyLink":"molloy-life/molloy-life-news/blood-drive","headline":"Donors needed for upcoming Blood Drive","previewText":"Molloy College will be hosting its semi-annual Blood Drive on Tuesday, Oct 7 and Wednesday, Oct 8 from 9:30am to 6:30 pm in the back of the Public Square. Donors must be at least 110 pounds and in general good health."},{"date":"Oct 02, 2014","storyLink":"molloy-life/molloy-life-news/club-fair","headline":"Fair held to get new club members","previewText":"With over fifty clubs on campus, Molloy has a place for students to explore almost any interest they can possibly have."},{"date":"Oct 02, 2014","imageSrc":"Images/molloylife/convoauthorthumb.jpg","storyLink":"molloy-life/molloy-life-news/convocation","headline":"Author shares passion for storytelling, writing experiences at annual convocation","previewText":"Molloy College&#39;s annual convocation featured author of One Amazing Thing, Chitra Divakaruni, on Oct 2."},{"date":"Oct 01, 2014","imageSrc":"Images/molloylife/aasmall.jpg","storyLink":"molloy-life/molloy-life-news/october-is-alcohol-awareness-month","headline":"October is Alcohol Awareness month","previewText":"Molloy College kicked off the month raising alcohol awareness by providing a drunk driving simulation in Wilbur on the first of October. Students and faculty were offered to sit in an arcade-style video game that simulates what it would be like driving drunk. The exercise is important to let students know how dangerous it is to drive while drinking."},{"date":"Sep 27, 2014","imageSrc":"Images/molloylife/wwsmall.jpg","storyLink":"molloy-life/molloy-life-news/wounded","headline":"Molloy and Wounded Warriors Project team up for the first time","previewText":"Beautiful weather and successful victories by the Molloy College men&#39;s and women&#39;s soccer team capped off a special Saturday, as Molloy Athletics honored and recognized our nation&#39;s wounded heroes through a partnership with the Wounded Warriors Project."},{"date":"Sep 26, 2014","storyLink":"molloy-life/molloy-life-news/jost-info","headline":"Get your Free Ticket for SNL&#39;s Colin Jost","previewText":"Tickets for Colin Jost Performance, Sat, October 18 at 9 p.m. can be ordered at Madison Theatre box office 516.323.4444 or in-person.  All seats are general admission."},{"date":"Sep 25, 2014","imageSrc":"Images/molloylife/subwaythumb.jpg","storyLink":"molloy-life/molloy-life-news/new-eats-on-campus","headline":"New options for eating on campus","previewText":"There are some exciting changes happening to on-campus dining services this year!  The new Subway, located on the first floor of the Public Square, recently opened for business and has been a huge hit with students so far.  Lines have been wrapping through the Public Square Lobby as students anxiously stand waiting even before the 11am opening time each day."},{"date":"Sep 25, 2014","imageSrc":"Images/Molloy Life/news_Images/StudentLargeThumb.jpg","storyLink":"molloy-life/molloy-life-news/student-personalizes-bows-for-customers","headline":"Student personalizes bows for customers","previewText":"While most students on campus buy their own hair products, Nicole Saviolis, a junior studying Professional Communications with a minor in Marketing,  has recently started her own business, Canolie Creations. Canolie Creations are unique handmade accessories used to express individuality and passion."},{"date":"Sep 11, 2014","imageSrc":"Images/Molloy Life/news_Images/GivingThumb.jpg","storyLink":"molloy-life/molloy-life-news/molloy-college-breaks-record-collecting-and-giving-food","headline":"Molloy College breaks record collecting and giving food","previewText":"Molloy College breaks record collecting and giving food"},{"date":"Sep 09, 2014","imageSrc":"Images/Molloy Life/news_Images/HPprojectadventureThumb.jpg","storyLink":"molloy-life/molloy-life-news/molloy-student-athletes-climb-project-adventure","headline":"Molloy Student-Athletes Climb Project Adventure","previewText":"Molloy Student-Athletes Climb Project Adventure"},{"date":"Aug 29, 2014","imageSrc":"Images/Molloy Life/news_Images/VolleballThumb.jpg","storyLink":"molloy-life/molloy-life-news/volleyball-has-high-hopes-for-upcoming-season","headline":"Volleyball has high hopes for upcoming season","previewText":"Volleyball has high hopes for upcoming season"},{"date":"Apr 02, 2014","imageSrc":"Images/Molloy Life/news_Images/Com Arts story.jpg","storyLink":"molloy-life/molloy-life-news/com-lab","headline":"New Media Lab Gives Communications Students Opportunities","previewText":"As the Fall 2013 semester began students taking communication courses, such as Writing for the Web, Online Content Production, and other New Media related classes were taught in a new computer lab specifically built to give students the tools needed to learn about the constantly changing industry of content production. Professors Tom Kenny and Jamie Cohen are the two faculty members most involved with the new lab. Professors Kenny is the Facilities Manager for both the lab and the TV studio, and Professor Cohen is the Program Director of the New Media program."},{"date":"Apr 02, 2014","imageSrc":"Images/Molloy Life/news_Images/Theater Thumb.jpg","storyLink":"molloy-life/molloy-life-news/theatre-arts-degree","headline":"Theatre Arts Degree","previewText":"The Admissions Office is very excited to announce the addition of a Bachelor Degree of Fine Arts in Theatre Arts to its list of degree programs offered here at Molloy College.  Starting in the fall semester of 2014, incoming freshmen can become a part of this four year program in conjunction with Collaborative Arts Project 21, Inc. (CAP21) in Manhattan."},{"date":"Mar 06, 2014","storyLink":"molloy-life/molloy-life-news/mens-basketball-playoffs-march-5","headline":"Molloy Advances to Semi-Finals","previewText":"Molloy Mens beat Queens, advancing to Semi-finals"},{"date":"Mar 06, 2014","storyLink":"molloy-life/molloy-life-news/short-films","headline":"Q &amp; A with Doug LeClair of the Short Film Concert","previewText":"After speaking with Doug LeClaire, the executive director of Asbury Shorts New York, his mission was clear.  His priority is to offer the world&#39;s greatest short film concert.  This sounds like a difficult task to most, but to Doug, it is his inherent ability.The Madison Theatre at Molloy College is lucky to be hosting Doug&#39;s extraordinary event for the third time on March 6th.  Asbury Shorts New York is a show unlike any other because it is a non-competitive, fast-paced, fun night out.  This is a unique opportunity to experience the world&#39;s best short films on a big screen and with the electric energy of an audience.  To understand Doug&#39;s event a little better, I asked him a few questions:"},{"date":"Feb 24, 2014","imageSrc":"Images/Molloy Life/news_Images/Track Champions.jpg","storyLink":"molloy-life/molloy-life-news/mens-indoor-track-and-field","headline":"Men&#39;s Indoor Track and Field team capture another Championship","previewText":"For the second year in a row, the Molloy men&#39;s indoor track and field team took home the East Coast Conference Championship on Feb. 22, at Saint Anthony&#39;s High School in Melville, N.Y.  First year Head Coach Daniel Naud and company earned a total of 138 points, edging out rival St. Thomas Aquinas by five points.  Director of Athletics, Susan Cassidy-Lyke, spoke about how proud she was of the accomplishment, &quot;Its unbelievable exciting, the kids worked really hard and it&#39;s a big deal winning two times in a row with two new head coaches.&quot;"},{"date":"Feb 24, 2014","storyLink":"molloy-life/molloy-life-news/womens-senior-night-game-feb-22","headline":"Women&#39;s Basketball Win in Stunning Fashion.","previewText":"Womens basketball"},{"date":"Feb 24, 2014","storyLink":"molloy-life/molloy-life-news/senior-night-for-john-n-tyler","headline":"An end of an Era","previewText":"Senior night for john and tyler"},{"date":"Feb 24, 2014","storyLink":"molloy-life/molloy-life-news/mens-senior-night","headline":"Lions eat Firebirds for lunch","previewText":"Mens basketball feb 22"},{"date":"Feb 24, 2014","storyLink":"molloy-life/molloy-life-news/kelly-senior-night","headline":"Senior Kelly Guerriero Shines on Senior Night","previewText":"Kelly Guerriero senior night"},{"date":"Feb 02, 2014","imageSrc":"Images/Molloy Life/news_Images/polarvideo photo.jpg","storyLink":"molloy-life/molloy-life-news/polar-plunge","headline":"Molloy Students do the Polar Bear Plunge","previewText":"Molloy students joined thousands of people on February 2, 2014 in Long Beach to dive in the frigid waters of the Atlantic Ocean during the annual Long Beach Polar Bear Plunge which raises money for the Make-A-Wish Foundation."},{"date":"Jan 24, 2014","imageSrc":"Images/Molloy Life/news_Images/MolloyLife Stori SThumb.jpg","storyLink":"molloy-life/molloy-life-news/molloy-life-brand","headline":"Molloy Life goes beyond social media to connect with students","previewText":"Molloy offers its students more opportunities to take a break from their studies and enrich themselves socially at an event or activity on campus."},{"date":"Jan 23, 2014","imageSrc":"Images/Molloy Life/news_Images/Winter Orientation Feature.jpg","storyLink":"molloy-life/molloy-life-news/winter-orientation","headline":"New Student Winter Orientation","previewText":"Are you a new student or transfer?  Although the semester already is in full swing, come by the Public Square Larini Room (Multipurpose Room, 2nd floor) on Thursday, January 23rd at 6:00 pm for dinner and free giveaways."},{"date":"Jan 22, 2014","imageSrc":"Images/Molloy Life/news_Images/feature.jpg","storyLink":"molloy-life/molloy-life-news/stuff-a-bear-preview","headline":"Stuff-A-Bear is back for the holiday","previewText":"On February 11, 2014, Molloy College Student Government will be hosting its annual Stuff-A-Bear event at 11 am in the Public Square lobby. If you need an inexpensive, heartfelt Valentine&#39;s Day present for a loved one, this is the place to be! Students can customize, stuff, and create a &quot;soul&quot; for a stuffed animal of their choice. The best part is, the first animal is free! This is a perfect gift to let your family, friend, or significant other know that someone from Molloy is thinking of them! Supplies are limited so get there early so you can get your pick of animals! You can purchase additional animals for $5."},{"date":"Jan 21, 2014","imageSrc":"Images/Molloy Life/news_Images/bundress thumb.jpg","storyLink":"molloy-life/molloy-life-news/beauty-undressed-preview","headline":"Beauty Undressed:  Beauty. What is it? Who has it? Who decides?","previewText":"On Tuesday, February 11, 2014, the Student Personal Counseling Center is hosting guest speaker Shannon Cutts, Founder, Board Chair, and Executive Director of MentorCONNECT, to give a presentation about how individuals and society view and express beauty every day."},{"date":"Oct 23, 2013","imageSrc":"Images/Molloy Life/news_Images/l thumb author ready player one(0).jpg","storyLink":"molloy-life/molloy-life-news/convocation-author-visit","headline":"Ready Player One author speaks to freshmen","previewText":"At this year&#39;s Convocation, Ernest Cline, author of this year&#39;s common reading book, Ready Player One, addressed the class of 2017.  He presented the attendees with his life story; one filled with video games, Star Wars, and a rise to stardom.  This seemingly average Ohio native is now an accomplished screen writer and author, all thanks to his enthusiasm for all things technological and science fictional."},{"date":"Oct 17, 2013","imageSrc":"Images/Molloy Life/news_Images/Matt xthumb.jpg","storyLink":"molloy-life/molloy-life-news/new-face-of-athletics","headline":"Molloy Athletics Department Gets A Fresh Face","previewText":"Neither the new title of Assistant Director of Athletics for Operations nor the easy commute from Seaford to Rockville Centre had been the reasons for Matt Guercio&#39;s decision to apply for the job, but the prospect of working at Molloy College represented change in his life. After being employed for seven years as Coordinator of Athletic Operations and Special Events for Long Island University Post, Guercio knew he needed to get out of his comfort zone and take on a larger task.&quot;I had really outgrown my position at LIU Post. I was ready for a change, and it [Assistant Director of Athletics for Operations] was an opportunity that I couldn&#39;t turn down,&quot; said Guercio."},{"date":"Oct 10, 2013","imageSrc":"Images/Molloy Life/news_Images/Dunk thunmbnail small.jpg","storyLink":"molloy-life/molloy-life-news/slam-dunk","headline":"Dunk contest pumps up student body","previewText":"One of the most exciting and athletic events ever created for basketball is the Slam Dunk Contest.   On Oct 11, at the Queally Gymnasium, Maroon Madness hosted several events. The 2013 Maroon Madness Slam Dunk contest was certainly the most exciting part of the night and lived up to ever expectation."},{"date":"Oct 10, 2013","storyLink":"molloy-life/molloy-life-news/maroon-madness","headline":"Maroon Madness kicks off Basketball Season","previewText":"It was a special night for the Molloy Community as the Molloy College Athletic Department hosted Maroon Madness, on Oct 11, at the Quealy Gymnasium. The night represented the start of the 2013-14 basketball seasons and in spectacular fashion, the men&#39;s and women&#39;s basketball team were introduced in front of cheering fans, faculty, family, and staff. &quot;We&#39;re excited about Maroon Madness and I think it&#39;s the biggest event we can pull off around this time,&quot; said Director of Athletics, Susan Cassidy-Lyke."},{"date":"Oct 08, 2013","imageSrc":"Images/Molloy Life/news_Images/geicoS Sthumb.jpg","storyLink":"molloy-life/molloy-life-news/geico-scholarship","headline":"Student recieves Geico Scholarship","previewText":"After presenting at the Career Prep workshop on Sept. 26, 2013, Geico&#39;s college recruiter Jeannie Toscano presented a $1,000 Achievement Award scholarship to junior, Kyle Brzoza."},{"date":"Oct 07, 2013","imageSrc":"Images/Molloy Life/news_Images/mymolloylifephoto2(1).jpg","storyLink":"molloy-life/molloy-life-news/mymolloylife-contest","headline":"Just Announced: #MyMolloyLife Instagram Contest","previewText":"Have you ever been asked to describe yourself in one word. Easy enough. But what if you had to do it in one photo? That&#39;s the premise of our new #MyMolloyLife contest happening over on Instagram starting on Monday, October 7, 2013. Here&#39;s what you have to do: Follow @Molloylife on Instagram, take a picture of what you consider your life in one photo to be (the items that best define you), and post it to your Instagram feed with the hashtag #MyMolloyLife. Be creative!"},{"date":"Oct 07, 2013","imageSrc":"Images/Molloy Life/news_Images/china Vist Thumb(0).jpg","storyLink":"molloy-life/molloy-life-news/panyu-polytechnic-university-visit-molloy","headline":"Chinese University officials visit Molloy","previewText":"On October 7, members of the Panyu Polytechnic University of China&#39;s business office, along with students from the university met at Molloy to tour the campus and get a sense of what Molloy&#39;s prestigious business program is all about."},{"date":"Sep 30, 2013","imageSrc":"Images/Molloy Life/news_Images/JoeRweb.jpg","storyLink":"molloy-life/molloy-life-news/motivational-speaker-joe-rhea-returns-to-talk-to-molloy-student-athletes","headline":"Motivational Speaker Joe Rhea returns to talk to students","previewText":"Last night, motivational speaker and beat-the-odds success story Joe Rhea returned to Molloy College to speak to student-athletes in the Madison Theatre on the school&#39;s Rockville Centre campus.At the age of 14, Rhea was paralyzed from the neck down after sustaining a football injury in one of his high school games. Numerous doctors and medical personnel told him to accept the fact that he would have to spend the rest of his life in a wheelchair. About a week later, some feeling returned to one of his legs and the doctors said if he was prepared to endure enormous amounts of pain and work harder than he could ever imagine, then he might be able to strengthen his body to be able to walk again.Well, Joe Rhea did just that."},{"date":"Sep 27, 2013","imageSrc":"Images/Molloy Life/news_Images/WSoccerSmallweb.jpg","storyLink":"molloy-life/molloy-life-news/womens-soccer-1","headline":"Healthy start has Molloy in contention","previewText":"Just two years removed from being one win away from capturing the East Coast Conference Championship, Molloy College women&#39;s soccer team is in the mix with a 1-1 East Coast Conference record and is 1-5 overall."},{"date":"Sep 27, 2013","imageSrc":"Images/Molloy Life/news_Images/websoccerSMALL.jpg","storyLink":"molloy-life/molloy-life-news/mens-soccer-1","headline":"Lions look like contenders early on","previewText":"The 2012 season for the Molloy men&#39;s soccer team ended in a disappointment, finishing with an overall record of 7-10, and 3-6, in the East Coast Conference. The performance by the team was better than what their record showed, six times the Lions lost by just one goal in 2012."},{"date":"Sep 27, 2013","imageSrc":"Images/Molloy Life/news_Images/CDCambass.jpg","storyLink":"molloy-life/molloy-life-news/career-ambassador-program","headline":"Career Development Center ready to help","previewText":"It is the downfall of every college student, the moment when you think about your future and think &quot;what am I going to do with my life after I graduate?&quot; Luckily, the Career Development Center (CDC) is here to help you answer that question."},{"date":"Sep 25, 2013","imageSrc":"Images/Molloy Life/news_Images/kanJam.jpg","storyLink":"molloy-life/molloy-life-news/kan-jam","headline":"Kan Jam Tournament at Molloy","previewText":"The Senior Class hosted the second Kan Jam tournament at Molloy College on Sept. 25, 2013. Over 15 teams of two signed up to compete for prizes. Snacks, along with pizza and drinks were supplied at the event for everyone to enjoy."},{"date":"Sep 18, 2013","imageSrc":"Images/Molloy Life/news_Images/Tennis Team.jpg","storyLink":"molloy-life/molloy-life-news/tennis-coach","headline":"Long Time Friendship Saves Tennis Team","previewText":"&lt;i&gt;by Nick Crispino -&lt;/i&gt; As students and faculty enjoyed the last days of summer in August, Director of Athletics, Susan Cassidy-Lyke had a problem. The women&#39;s tennis team did not have a head coach to call their own. The answer came in the form of a long-time friendship between Senior tennis player Nikki Gloria and Victor Caraballo. &quot;She asked if I wanted to coach and she was really aggressive about,&quot; said Caraballo.  Within the same day of submitting his application, Caraballo received a phone call to come in for an interview with Cassidy-Lyke. When asked about the meeting, Caraballo said, &quot;we had a conversation and liked where we were going and I said okay.&quot; This isn&#39;t Caraballo&#39;s first go around coaching, he has been involved in teaching the sport for nineteen years."},{"date":"Sep 15, 2013","imageSrc":"Images/Molloy Life/news_Images/PoetJam(2).jpg","storyLink":"molloy-life/molloy-life-news/poetry-jam","headline":"Actress highlights Poetry Jam","previewText":"&lt;i&gt;by Alexa Sussman -&lt;/i&gt;  On September 15, 2013, Madison Theatre at Molloy College held Poetry Jam, an event featuring Amber Tamblyn, a film/television star and poetry performer, and Derrick C. Brown, poet and president of Write Bloody Publishing. Local poets Peter Dugan, Megan Falley, Vicki Iorio, and Christina Rau were also there to share their poems, both old favorites and new additions."},{"date":"Sep 11, 2013","imageSrc":"Images/Molloy Life/news_Images/MolloyLife_Volleyball.jpg","storyLink":"molloy-life/molloy-life-news/lions-feast-on-golden-falcons-in-home-opener","headline":"Lions feast on Golden Falcons in Home Opener","previewText":"by Nick Crispino -       It was a successful home opener for the Molloy College volleyball team, beating Felician College, 3-1 (23-25, 25-23, 18-25, 21-25) at the Quealy Gymnasium, Rockville Centre, on Wednesday night. The win is their third in a row and puts the Lions over .500 on the season with a record of 3-2. Junior outside hitter, Sam Berna, helped Molloy win with a stellar performance, leading the team in points (19), kills (16) and digs (14). Sophomore outside hitter, Cassie Palmer and Junior right side hitter, Shannon Appeal also contributed immensely, earning double digit points on the night. Palmer produced 13 kills and 10 digs for a total of 17.5 points and Appeal contributed 9 kills and 2 blocks giving her 10 points."},{"date":"Sep 09, 2013","imageSrc":"Images/Molloy Life/news_Images/BBQ Small thumb.jpg","storyLink":"molloy-life/molloy-life-news/welcome-back-bash","headline":"&#39;Bash&#39; begins new school year","previewText":"&lt;i&gt;by Marilena Rocco -&lt;/i&gt;  The Welcome Back Bash marks the beginning of another school year at Molloy College. The Welcome Back Bash, a party on the Campus Green, was a welcome to new and returning students."},{"date":"Sep 05, 2013","imageSrc":"Images/Molloy Life/news_Images/lasertag thumb.jpg","storyLink":"molloy-life/molloy-life-news/laser-tag","headline":"Laser Tag fills gym on first day","previewText":"&lt;i&gt;by Michael Schultz -&lt;/i&gt; The first day of classes ended with a &quot;bang!&quot; as Molloy College kicked off the school year with an evening of Laser Tag."},{"date":"Aug 22, 2013","imageSrc":"Images/Molloy Life/news_Images/Story_2.jpg","storyLink":"molloy-life/molloy-life-news/what-is-the-office-of-the-first-year-experience","headline":"What is the Office of the First Year Experience?","previewText":"The Office of the First Year Experiences sponsors Freshmen Learning Communities. These communities link courses together for incoming freshmen with a common theme."},{"date":"Aug 22, 2013","imageSrc":"Images/Molloy Life/news_Images/Story_3.jpg","storyLink":"molloy-life/molloy-life-news/global-learning-experience-london-england","headline":"Global Learning Experience: London, England","previewText":"Choosing to go on one of the Global Learning programs through Molloy was one of the biggest highlights of my college experience so far!"},{"date":"Aug 22, 2013","imageSrc":"Images/Molloy Life/news_Images/Story_1.jpg","storyLink":"molloy-life/molloy-life-news/the-dangers-of-social-media","headline":"The Dangers of Social Media","previewText":"One of the many gifts the twenty-first century has brought to the world is the use of social media websites such as Facebook and Twitter. With the touch of a button, and a few seconds of our time, we can connect instantly with our friends, family, and communities. The use of social media sites has changed the way we communicate with the world as well as how we project our feelings onto others. Information is flowing faster than ever before because of these sites, and if you&#39;re not careful, you can unintentionally harm yourself, friends, or loved ones.&lt;br&gt;&lt;/br&gt;On the surface, social websites are fun, beneficial, and productive. But when you go deep into the pages of tweets, pictures, and comments, social media sites can be a frightening tool used against the user. I can write about the stalkers, pedophiles, bullies, and others who abuse these sites for their own selfish gain, but instead of just stating my opinion on how dangerous these websites can be, I would rather show specific examples of how average social media users can set up their own demise without even knowing it."}]
=======
[{"date":"Jan 29, 2015","imageSrc":"Images/SienaBC_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/sienabookclub","headline":"The Siena Women&#39;s Center Book Club","previewText":"Since its first meeting discussing the worldwide bestselling novel &quot;The Da Vinci Code,&quot; by Dan Brown, the Siena Women&#39;s Center book club has been a success for over seven years."},{"date":"Jan 29, 2015","imageSrc":"Images/ProjAlm_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/projectalmanac","headline":"First Look: Project Almanac","previewText":"If you are into sci-fi time travel movies and stories, such as Back to the Future or Steins;Gate, you will easily fall in love with Project Almanac."},{"date":"Jan 20, 2015","imageSrc":"Images/BuzzerBeater_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/gamewinningliupost","headline":"Game-Winning, Buzzer-Beating Layup vs. LIU Post","previewText":"Watch Molloy College&#39;s  game-winning, buzzer-beating layup to help the Lions defeat East Coast Conference-foe LIU Post."},{"date":"Jan 14, 2015","imageSrc":"Images/HoF2015_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/halloffame2015","headline":"Athletics Hall of Fame 2015","previewText":"This past Friday evening, the Molloy College Department of Athletics honored four individuals by inducting them into the Molloy Athletic Hall of Fame at the Milleridge Cottage in Jericho, Long Island. Donna Lohrey Classie &#39;06 (Women&#39;s Basketball, 2002-06), Lauren Catania Daly &#39;05 (Women&#39;s Soccer, 2000-03),Joe Holden (Baseball, 2003-05) and Ettore Morelli &#39;09 (Men&#39;s Soccer, 2004-08) joined the ranks of Molloy Athletics&#39; most impressive and successful."},{"date":"Jan 12, 2015","imageSrc":"Images/NightOut_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/eccnightoutonthelion","headline":"ECC Night Out On The Lion","previewText":"Before the Christmas holiday, Molloy College Athletics hosted the 2nd Annual &quot;Night Out On The Lion&quot; event as part of a conference-wide community initiative. The event allowed parents the opportunity to have an evening out after dropping off their children in a fun environment with activities run by student-athletes. A photo gallery and video highlight reel are available at the links above."},{"date":"Dec 11, 2014","imageSrc":"Images/santasworkshop_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/santasworkshop","headline":"Families flock to Santa&#39;s Workshop!","previewText":"The holiday spirit filled the Public Square lobby when Santa Clause made a special visit to Molloy College by spreading joy at the annual Santa’s Workshop event on Dec 6."},{"date":"Dec 11, 2014","imageSrc":"Images/IraqStory_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/iraqfamilies","headline":"Molloy pitches in to help displaced Iraqi families.","previewText":"Eleven years later, Iraq is still immersed in turmoil, destitution, and chaos. In these hard times that the Iraqi people face, the Dominican Tradition of Molloy College (Mission Integration and Campus Ministries) came together to raise over $4,000 for Sister Maria Hanna, of the Dominican Sisters of St. Catherine of Siena, Iraq, in October."},{"date":"Dec 11, 2014","imageSrc":"Images/BITD_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/breakfastinthedark","headline":"Breakfast In The Dark","previewText":"The third annual Breakfast in in the Dark event, hosted by LEAD Club, Club TRiO, and the Social Work Club, was a success as over a hundred participants ate their meals blind folded and in the dark on Tuesday, Dec 2 at the Hayes Theater."},{"date":"Dec 02, 2014","imageSrc":"Images/articlethumb.jpg","storyLink":"molloy-life/molloy-life-news/mrmolloy","headline":"Mr. Molloy 2014","previewText":"Talent and style shined bright as Michael Goldin became the first freshman ever crowned Mr. Molloy.  Sponsored by the Senior Class of MSG, Mr. Molloy was host to ten students competing for the coveted title on the night of November 20th in the Madison Theatre."},{"date":"Dec 02, 2014","imageSrc":"Images/","storyLink":"molloy-life/molloy-life-news/anselmagrandopening","headline":"Anselma Room Grand Opening!","previewText":"A DJ and party lights lit up the revitalized Anselma Room as Molloy celebrated its grand opening.  While officially open for business on Sunday, November 30th, that Monday played host to a party for the occasion."},{"date":"Nov 13, 2014","imageSrc":"Images/VD14_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/beauty-undressed-preview","headline":"Beauty Undressed:  Beauty. What is it? Who has it? Who decides?","previewText":"On Tuesday, February 11, 2014, the Student Personal Counseling Center is hosting guest speaker Shannon Cutts, Founder, Board Chair, and Executive Director of MentorCONNECT, to give a presentation about how individuals and society view and express beauty every day."},{"date":"Nov 13, 2014","imageSrc":"Images/halloween_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/halloween2014","headline":"Halloween Party!","previewText":"There is no question that one of the largest events on campus is the annual Halloween Party"},{"date":"Nov 13, 2014","imageSrc":"Images/coffee_large.jpg","storyLink":"molloy-life/molloy-life-news/coffeehouse","headline":"Music Therapy Coffee House","previewText":"On October 28th 2014, Molloy’s Music Therapy Club held it’s fall Coffee House event."},{"date":"Nov 13, 2014","imageSrc":"Images/careerfair_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/careerfair","headline":"Career Fair helps students fulfill their passions","previewText":"On Oct 30, the Career Development Center held their annual Career Fair in the Multipurpose Room."},{"date":"Oct 29, 2014","imageSrc":"Images/StudentDinner_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/studentdinner","headline":"Staff Sponsored Student Dinner","previewText":"Residents of Maria Regina Hall and Fitzgerald Hall were in for a surprise as staff at Molloy College provided dinner and dessert for 257 students on Oct 20 at both buildings."},{"date":"Oct 29, 2014","imageSrc":"Images/haunted_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/hauntedmansion","headline":"Haunted Mansion at Hays Theatre","previewText":"On the nights of October 24th and 25th, crowds lined up in the Wilbur Lobby to enter the Haunted Mansion in the Hays Theatre. This event was sponsored by the Molloy Performing Arts Club and co-sponsored by the ASL Club."},{"date":"Oct 23, 2014","imageSrc":"Images/Hcoming2014_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/homecoming2014","headline":"Homecoming Weekend","previewText":"Molloy College’s Homecoming weekend is about meshing the past with the present to create a better future"},{"date":"Oct 22, 2014","imageSrc":"Images/CDB_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/conversationwithdrdrew","headline":"Dr. Bogner Goes on Listening Tour of Campus","previewText":"While students at most other colleges may never get to interact with their school’s president, Dr. Drew Bogner, President of Molloy College, has set a different tone in an attempt to open a dialogue with students on campus"},{"date":"Oct 22, 2014","imageSrc":"Images/MM2014_thumbnail.jpg","storyLink":"molloy-life/molloy-life-news/maroonmadness2014","headline":"Maroon Madness 2014","previewText":"Maroon Madness kicked off the opening of the 2014-15 men’s and women’s basketball season on Oct 16 at the Quealy Gymnasium in Wilbur with almost 1,000 spectators in the stands"},{"date":"Oct 17, 2014","imageSrc":"Images/molloylife/IS_Speaker_thumb.jpg","storyLink":"molloy-life/molloy-life-news/investment-speaker","headline":"Investment Club Featured Speaker","previewText":"On Wednesday, October 1, the Investment Club hosted Philip Roth, a retired Chartered Market Technician, as a guest speaker in the Public Square Multipurpose Room"},{"date":"Oct 07, 2014","imageSrc":"Images/molloylife/ppsmall(0).jpg","storyLink":"molloy-life/molloy-life-news/club-spotlight-pp","headline":"Spotlight: Break the Silence Club","previewText":"A little less than two years ago, a student came to the office of Teresa Aprigliano, Associate Dean and Director of the Division of Nursing, seeking help as her personal life was being affected by relationship violence."},{"date":"Oct 02, 2014","imageSrc":"Images/molloylife/convoauthorthumb.jpg","storyLink":"molloy-life/molloy-life-news/convocation","headline":"Author shares passion for storytelling, writing experiences at annual convocation","previewText":"Molloy College&#39;s annual convocation featured author of One Amazing Thing, Chitra Divakaruni, on Oct 2."},{"date":"Oct 02, 2014","imageSrc":"Images/","storyLink":"molloy-life/molloy-life-news/club-fair","headline":"Fair held to get new club members","previewText":"With over fifty clubs on campus, Molloy has a place for students to explore almost any interest they can possibly have."},{"date":"Oct 02, 2014","imageSrc":"Images/Molloy Life/news_Images/polarvideo photo.jpg","storyLink":"molloy-life/molloy-life-news/polar-plunge","headline":"Molloy Students do the Polar Bear Plunge","previewText":"Molloy students joined thousands of people on February 2, 2014 in Long Beach to dive in the frigid waters of the Atlantic Ocean during the annual Long Beach Polar Bear Plunge which raises money for the Make-A-Wish Foundation."},{"date":"Oct 01, 2014","imageSrc":"Images/molloylife/aasmall.jpg","storyLink":"molloy-life/molloy-life-news/october-is-alcohol-awareness-month","headline":"October is Alcohol Awareness month","previewText":"Molloy College kicked off the month raising alcohol awareness by providing a drunk driving simulation in Wilbur on the first of October. Students and faculty were offered to sit in an arcade-style video game that simulates what it would be like driving drunk. The exercise is important to let students know how dangerous it is to drive while drinking."},{"date":"Sep 27, 2014","imageSrc":"Images/molloylife/wwsmall.jpg","storyLink":"molloy-life/molloy-life-news/wounded","headline":"Molloy and Wounded Warriors Project team up for the first time","previewText":"Beautiful weather and successful victories by the Molloy College men&#39;s and women&#39;s soccer team capped off a special Saturday, as Molloy Athletics honored and recognized our nation&#39;s wounded heroes through a partnership with the Wounded Warriors Project."},{"date":"Sep 26, 2014","imageSrc":"Images/","storyLink":"molloy-life/molloy-life-news/jost-info","headline":"Get your Free Ticket for SNL&#39;s Colin Jost","previewText":"Tickets for Colin Jost Performance, Sat, October 18 at 9 p.m. can be ordered at Madison Theatre box office 516.323.4444 or in-person.  All seats are general admission."},{"date":"Sep 25, 2014","imageSrc":"Images/molloylife/subwaythumb.jpg","storyLink":"molloy-life/molloy-life-news/new-eats-on-campus","headline":"New options for eating on campus","previewText":"There are some exciting changes happening to on-campus dining services this year!  The new Subway, located on the first floor of the Public Square, recently opened for business and has been a huge hit with students so far.  Lines have been wrapping through the Public Square Lobby as students anxiously stand waiting even before the 11am opening time each day."},{"date":"Sep 25, 2014","imageSrc":"Images/Molloy Life/news_Images/StudentLargeThumb.jpg","storyLink":"molloy-life/molloy-life-news/student-personalizes-bows-for-customers","headline":"Student personalizes bows for customers","previewText":"While most students on campus buy their own hair products, Nicole Saviolis, a junior studying Professional Communications with a minor in Marketing,  has recently started her own business, Canolie Creations. Canolie Creations are unique handmade accessories used to express individuality and passion."},{"date":"Sep 11, 2014","imageSrc":"Images/Molloy Life/news_Images/GivingThumb.jpg","storyLink":"molloy-life/molloy-life-news/molloy-college-breaks-record-collecting-and-giving-food","headline":"Molloy College breaks record collecting and giving food","previewText":"Molloy College breaks record collecting and giving food"},{"date":"Sep 09, 2014","imageSrc":"Images/Molloy Life/news_Images/HPprojectadventureThumb.jpg","storyLink":"molloy-life/molloy-life-news/molloy-student-athletes-climb-project-adventure","headline":"Molloy Student-Athletes Climb Project Adventure","previewText":"Molloy Student-Athletes Climb Project Adventure"},{"date":"Aug 29, 2014","imageSrc":"Images/Molloy Life/news_Images/VolleballThumb.jpg","storyLink":"molloy-life/molloy-life-news/volleyball-has-high-hopes-for-upcoming-season","headline":"Volleyball has high hopes for upcoming season","previewText":"Volleyball has high hopes for upcoming season"},{"date":"Apr 02, 2014","imageSrc":"Images/Molloy Life/news_Images/Theater Thumb.jpg","storyLink":"molloy-life/molloy-life-news/theatre-arts-degree","headline":"Theatre Arts Degree","previewText":"The Admissions Office is very excited to announce the addition of a Bachelor Degree of Fine Arts in Theatre Arts to its list of degree programs offered here at Molloy College.  Starting in the fall semester of 2014, incoming freshmen can become a part of this four year program in conjunction with Collaborative Arts Project 21, Inc. (CAP21) in Manhattan."},{"date":"Apr 02, 2014","imageSrc":"Images/Molloy Life/news_Images/Com Arts story.jpg","storyLink":"molloy-life/molloy-life-news/com-lab","headline":"New Media Lab Gives Communications Students Opportunities","previewText":"As the Fall 2013 semester began students taking communication courses, such as Writing for the Web, Online Content Production, and other New Media related classes were taught in a new computer lab specifically built to give students the tools needed to learn about the constantly changing industry of content production. Professors Tom Kenny and Jamie Cohen are the two faculty members most involved with the new lab. Professors Kenny is the Facilities Manager for both the lab and the TV studio, and Professor Cohen is the Program Director of the New Media program."},{"date":"Mar 06, 2014","imageSrc":"Images/","storyLink":"molloy-life/molloy-life-news/mens-basketball-playoffs-march-5","headline":"Molloy Advances to Semi-Finals","previewText":"Molloy Mens beat Queens, advancing to Semi-finals"},{"date":"Mar 06, 2014","imageSrc":"Images/","storyLink":"molloy-life/molloy-life-news/short-films","headline":"Q &amp; A with Doug LeClair of the Short Film Concert","previewText":"After speaking with Doug LeClaire, the executive director of Asbury Shorts New York, his mission was clear.  His priority is to offer the world&#39;s greatest short film concert.  This sounds like a difficult task to most, but to Doug, it is his inherent ability.The Madison Theatre at Molloy College is lucky to be hosting Doug&#39;s extraordinary event for the third time on March 6th.  Asbury Shorts New York is a show unlike any other because it is a non-competitive, fast-paced, fun night out.  This is a unique opportunity to experience the world&#39;s best short films on a big screen and with the electric energy of an audience.  To understand Doug&#39;s event a little better, I asked him a few questions:"},{"date":"Feb 24, 2014","imageSrc":"Images/Molloy Life/news_Images/Track Champions.jpg","storyLink":"molloy-life/molloy-life-news/mens-indoor-track-and-field","headline":"Men&#39;s Indoor Track and Field team capture another Championship","previewText":"For the second year in a row, the Molloy men&#39;s indoor track and field team took home the East Coast Conference Championship on Feb. 22, at Saint Anthony&#39;s High School in Melville, N.Y.  First year Head Coach Daniel Naud and company earned a total of 138 points, edging out rival St. Thomas Aquinas by five points.  Director of Athletics, Susan Cassidy-Lyke, spoke about how proud she was of the accomplishment, &quot;Its unbelievable exciting, the kids worked really hard and it&#39;s a big deal winning two times in a row with two new head coaches.&quot; \r\n\t\t\t\t\t\t\t\t\t\t\t>"},{"date":"Feb 24, 2014","imageSrc":"Images/","storyLink":"molloy-life/molloy-life-news/kelly-senior-night","headline":"Senior Kelly Guerriero Shines on Senior Night","previewText":"Kelly Guerriero senior night"},{"date":"Feb 24, 2014","imageSrc":"Images/","storyLink":"molloy-life/molloy-life-news/mens-senior-night","headline":"Lions eat Firebirds for lunch","previewText":"Mens basketball feb 22"},{"date":"Feb 24, 2014","imageSrc":"Images/","storyLink":"molloy-life/molloy-life-news/senior-night-for-john-n-tyler","headline":"An end of an Era","previewText":"Senior night for john and tyler"},{"date":"Feb 24, 2014","imageSrc":"Images/","storyLink":"molloy-life/molloy-life-news/womens-senior-night-game-feb-22","headline":"Women&#39;s Basketball Win in Stunning Fashion.","previewText":"Womens basketball"},{"date":"Jan 24, 2014","imageSrc":"Images/Molloy Life/news_Images/MolloyLife Stori SThumb.jpg","storyLink":"molloy-life/molloy-life-news/molloy-life-brand","headline":"Molloy Life goes beyond social media to connect with students","previewText":"Molloy offers its students more opportunities to take a break from their studies and enrich themselves socially at an event or activity on campus."},{"date":"Jan 23, 2014","imageSrc":"Images/Molloy Life/news_Images/Winter Orientation Feature.jpg","storyLink":"molloy-life/molloy-life-news/winter-orientation","headline":"New Student Winter Orientation","previewText":"Are you a new student or transfer?  Although the semester already is in full swing, come by the Public Square Larini Room (Multipurpose Room, 2nd floor) on Thursday, January 23rd at 6:00 pm for dinner and free giveaways."},{"date":"Jan 22, 2014","imageSrc":"Images/Molloy Life/news_Images/feature.jpg","storyLink":"molloy-life/molloy-life-news/stuff-a-bear-preview","headline":"Stuff-A-Bear is back for the holiday","previewText":"On February 11, 2014, Molloy College Student Government will be hosting its annual Stuff-A-Bear event at 11 am in the Public Square lobby. If you need an inexpensive, heartfelt Valentine&#39;s Day present for a loved one, this is the place t>"},{"date":"Oct 23, 2013","imageSrc":"Images/Molloy Life/news_Images/l thumb author ready player one(0).jpg","storyLink":"molloy-life/molloy-life-news/convocation-author-visit","headline":"Ready Player One author speaks to freshmen","previewText":"At this year&#39;s Convocation, Ernest Cline, author of this year&#39;s common reading book, Ready Player One, addressed the class of 2017.  He presented the attendees with his life story; one filled with video games, Star Wars, and a rise to stardom.  This seemingly average Ohio native is now an accomplished screen writer and author, all thanks to his enthusiasm for all things technological and science fictional."},{"date":"Oct 17, 2013","imageSrc":"Images/Molloy Life/news_Images/Matt xthumb.jpg","storyLink":"molloy-life/molloy-life-news/new-face-of-athletics","headline":"Molloy Athletics Department Gets A Fresh Face","previewText":"Neither the new title of Assistant Director of Athletics for Operations nor the easy commute from Seaford to Rockville Centre had been the reasons for Matt Guercio&#39;s decision to apply for the job, but the prospect of working at Molloy College represented change in his life. After being employed for seven years as Coordinator of Athletic Operations and Special Events for Long Island University Post, Guercio knew he needed to get out of his comfort zone and take on a larger task.&quot;I had really outgrown my position at LIU Post. I was ready for a change, and it [Assistant Director of Athletics for Operations] was an opportunity that I couldn&#39;t turn down,&quot; said Guercio."},{"date":"Oct 10, 2013","imageSrc":"Images/Molloy Life/news_Images/Dunk thunmbnail small.jpg","storyLink":"molloy-life/molloy-life-news/slam-dunk","headline":"Dunk contest pumps up student body","previewText":"One of the most exciting and athletic events ever created for basketball is the Slam Dunk Contest.   On Oct 11, at the Queally Gymnasium, Maroon Madness hosted several events. The 2013 Maroon Madness Slam Dunk contest was certainly the most exciting part of the night and lived up to ever expectation."},{"date":"Oct 10, 2013","imageSrc":"Images/","storyLink":"molloy-life/molloy-life-news/maroon-madness","headline":"Maroon Madness kicks off Basketball Season","previewText":"It was a special night for the Molloy Community as the Molloy College Athletic Department hosted Maroon Madness, on Oct 11, at the Quealy Gymnasium. The night represented the start of the 2013-14 basketball seasons and in spectacular fashion, the men&#39;s and women&#39;s basketball team were introduced in front of cheering fans, faculty, family, and staff. &quot;We&#39;re excited about Maroon Madness and I think it&#39;s the biggest event we can pull off around this time,&quot; said Director of Athletics, Susan Cassidy-Lyke."},{"date":"Oct 08, 2013","imageSrc":"Images/Molloy Life/news_Images/geicoS Sthumb.jpg","storyLink":"molloy-life/molloy-life-news/geico-scholarship","headline":"Student recieves Geico Scholarship","previewText":"After presenting at the Career Prep workshop on Sept. 26, 2013, Geico&#39;s college recruiter Jeannie Toscano presented a $1,000 Achievement Award scholarship to junior, Kyle Brzoza."},{"date":"Oct 07, 2013","imageSrc":"Images/Molloy Life/news_Images/mymolloylifephoto2(1).jpg","storyLink":"molloy-life/molloy-life-news/mymolloylife-contest","headline":"Just Announced: #MyMolloyLife Instagram Contest","previewText":"Have you ever been asked to describe yourself in one word. Easy enough. But what if you had to do it in one photo? That&#39;s the premise of our new #MyMolloyLife contest happening over on Instagram starting on Monday, October 7, 2013. Here&#39;s what you have to do: Follow @Molloylife on Instagram, take a picture of what you consider your life in one photo to be (the items that best define you), and post it to your Instagram feed with the hashtag #MyMolloyLife. Be creative!"},{"date":"Oct 07, 2013","imageSrc":"Images/Molloy Life/news_Images/china Vist Thumb(0).jpg","storyLink":"molloy-life/molloy-life-news/panyu-polytechnic-university-visit-molloy","headline":"Chinese University officials visit Molloy","previewText":"On October 7, members of the Panyu Polytechnic University of China&#39;s business office, along with students from the university met at Molloy to tour the campus and get a sense of what Molloy&#39;s prestigious business program is all about."},{"date":"Sep 30, 2013","imageSrc":"Images/Molloy Life/news_Images/JoeRweb.jpg","storyLink":"molloy-life/molloy-life-news/motivational-speaker-joe-rhea-returns-to-talk-to-molloy-student-athletes","headline":"Motivational Speaker Joe Rhea returns to talk to students","previewText":"Last night, motivational speaker and beat-the-odds success story Joe Rhea returned to Molloy College to speak to student-athletes in the Madison Theatre on the school&#39;s Rockville Centre campus.At the age of 14, Rhea was paralyzed from the neck down after sustaining a football injury in one of his high school games. Numerous doctors and medical personnel told him to accept the fact that he would have to spend the rest of his life in a wheelchair. About a week later, some feeling returned to one of his legs and the doctors said if he was prepared to endure enormous amounts of pain and work harder than he could ever imagine, then he might be able to strengthen his body to be able to walk again.Well, Joe Rhea did just that."},{"date":"Sep 27, 2013","imageSrc":"Images/Molloy Life/news_Images/WSoccerSmallweb.jpg","storyLink":"molloy-life/molloy-life-news/womens-soccer-1","headline":"Healthy start has Molloy in contention","previewText":"Just two years removed from being one win away from capturing the East Coast Conference Championship, Molloy College women&#39;s soccer team is in the mix with a 1-1 East Coast Conference record and is 1-5 overall."},{"date":"Sep 27, 2013","imageSrc":"Images/Molloy Life/news_Images/CDCambass.jpg","storyLink":"molloy-life/molloy-life-news/career-ambassador-program","headline":"Career Development Center ready to help","previewText":"It is the downfall of every college student, the moment when you think about your future and think &quot;what am I going to do with my life after I graduate?&quot; Luckily, the Career Development Center (CDC) is here to help you answer that question."},{"date":"Sep 27, 2013","imageSrc":"Images/Molloy Life/news_Images/websoccerSMALL.jpg","storyLink":"molloy-life/molloy-life-news/mens-soccer-1","headline":"Lions look like contenders early on","previewText":"The 2012 season for the Molloy men&#39;s soccer team ended in a disappointment, finishing with an overall record of 7-10, and 3-6, in the East Coast Conference. The performance by the team was better than what their record showed, six times the Lions lost by just one goal in 2012."},{"date":"Sep 25, 2013","imageSrc":"Images/Molloy Life/news_Images/kanJam.jpg","storyLink":"molloy-life/molloy-life-news/kan-jam","headline":"Kan Jam Tournament at Molloy","previewText":"The Senior Class hosted the second Kan Jam tournament at Molloy College on Sept. 25, 2013. Over 15 teams of two signed up to compete for prizes. Snacks, along with pizza and drinks were supplied at the event for everyone to enjoy."},{"date":"Sep 18, 2013","imageSrc":"Images/Molloy Life/news_Images/Tennis Team.jpg","storyLink":"molloy-life/molloy-life-news/tennis-coach","headline":"Long Time Friendship Saves Tennis Team","previewText":"&lt;i&gt;by Nick Crispino -&lt;/i&gt; As students and faculty enjoyed the last days of summer in August, Director of Athletics, Susan Cassidy-Lyke had a problem. The women&#39;s tennis team did not have a head coach to call their own. The answer came in the form of a long-time friendship between Senior tennis player Nikki Gloria and Victor Caraballo. &quot;She asked if I wanted to coach and she was really aggressive about,&quot; said Caraballo.  Within the same day of submitting his application, Caraballo received a phone call to come in for an interview with Cassidy-Lyke. When asked about the meeting, Caraballo said, &quot;we had a conversation and liked where we were going and I said okay.&quot; This isn&#39;t Caraballo&#39;s first go around coaching, he has been involved in teaching the sport for nineteen years."},{"date":"Sep 15, 2013","imageSrc":"Images/Molloy Life/news_Images/PoetJam(2).jpg","storyLink":"molloy-life/molloy-life-news/poetry-jam","headline":"Actress highlights Poetry Jam","previewText":"&lt;i&gt;by Alexa Sussman -&lt;/i&gt;  On September 15, 2013, Madison Theatre at Molloy College held Poetry Jam, an event featuring Amber Tamblyn, a film/television star and poetry performer, and Derrick C. Brown, poet and president of Write Bloody Publishing. Local poets Peter Dugan, Megan Falley, Vicki Iorio, and Christina Rau were also there to share their poems, both old favorites and new additions."},{"date":"Sep 11, 2013","imageSrc":"Images/Molloy Life/news_Images/MolloyLife_Volleyball.jpg","storyLink":"molloy-life/molloy-life-news/lions-feast-on-golden-falcons-in-home-opener","headline":"Lions feast on Golden Falcons in Home Opener","previewText":"by Nick Crispino -       It was a successful home opener for the Molloy College volleyball team, beating Felician College, 3-1 (23-25, 25-23, 18-25, 21-25) at the Quealy Gymnasium, Rockville Centre, on Wednesday night. The win is their third in a row and puts the Lions over .500 on the season with a record of 3-2. Junior outside hitter, Sam Berna, helped Molloy win with a stellar performance, leading the team in points (19), kills (16) and digs (14). Sophomore outside hitter, Cassie Palmer and Junior right side hitter, Shannon Appeal also contributed immensely, earning double digit points on the night. Palmer produced 13 kills and 10 digs for a total of 17.5 points and Appeal contributed 9 kills and 2 blocks giving her 10 points."},{"date":"Sep 09, 2013","imageSrc":"Images/Molloy Life/news_Images/BBQ Small thumb.jpg","storyLink":"molloy-life/molloy-life-news/welcome-back-bash","headline":"&#39;Bash&#39; begins new school year","previewText":"&lt;i&gt;by Marilena Rocco -&lt;/i&gt;  The Welcome Back Bash marks the beginning of another school year at Molloy College. The Welcome Back Bash, a party on the Campus Green, was a welcome to new and returning students."},{"date":"Sep 05, 2013","imageSrc":"Images/Molloy Life/news_Images/lasertag thumb.jpg","storyLink":"molloy-life/molloy-life-news/laser-tag","headline":"Laser Tag fills gym on first day","previewText":"&lt;i&gt;by Michael Schultz -&lt;/i&gt; The first day of classes ended with a &quot;bang!&quot; as Molloy College kicked off the school year with an evening of Laser Tag."},{"date":"Aug 22, 2013","imageSrc":"Images/Molloy Life/news_Images/Story_3.jpg","storyLink":"molloy-life/molloy-life-news/global-learning-experience-london-england","headline":"Global Learning Experience: London, England","previewText":"Choosing to go on one of the Global Learning programs through Molloy was one of the biggest highlights of my college experience so far!"},{"date":"Aug 22, 2013","imageSrc":"Images/Molloy Life/news_Images/Story_1.jpg","storyLink":"molloy-life/molloy-life-news/the-dangers-of-social-media","headline":"The Dangers of Social Media","previewText":"One of the many gifts the twenty-first century has brought to the world is the use of social media websites such as Facebook and Twitter. With the touch of a button, and a few seconds of our time, we can connect instantly with our friends, family, and communities. The use of social media sites has changed the way we communicate with the world as well as how we project our feelings onto others. Information is flowing faster than ever before because of these sites, and if you&#39;re not careful, you can unintentionally harm yourself, friends, or loved ones.&lt;br&gt;&lt;/br&gt;On the surface, social websites are fun, beneficial, and productive. But when you go deep into the pages of tweets, pictures, and comments, social media sites can be a frightening tool used against the user. I can write about the stalkers, pedophiles, bullies, and others who abuse these sites for their own selfish gain, but instead of just stating my opinion on how dangerous these websites can be, I would rather show specific examples of how average social media users can set up their own demise without even knowing it."},{"date":"Aug 22, 2013","imageSrc":"Images/Molloy Life/news_Images/Story_2.jpg","storyLink":"molloy-life/molloy-life-news/what-is-the-office-of-the-first-year-experience","headline":"What is the Office of the First Year Experience?","previewText":"The Office of the First Year Experiences sponsors Freshmen Learning Communities. These communities link courses together for incoming freshmen with a common theme."}]
>>>>>>> FETCH_HEAD
