{
  "AAaCO": {
    "name": "African American and Caribbean Organization (AACO)",
    "description": "AACO was established to celebrate cultural differences among African American students and Caribbean students,to generate common interests among students of all nationalities and to sponsor cultural exchanges and educational programs.",
    "contact": ["AACO@lions.molloy.edu"]
  },

  "AmericanRedCrossClub": {
    "name":"American Red Cross Club",
    "description": "The Red Cross Club raises awareness and provides Red Cross services to the students of Molloy College as well as the local community. Club members act in accordance with the American Red Cross Code of Conduct.",
    "contact": ["RedCrossClub@lions.molloy.edu"]
  },

  "AmericanSignLanguageClub": {
    "name": "American Sign Language Club",
    "description": "The American Sign Language Club raises awareness for the deaf population and is involved with community service projects in the local community. We welcome all and invite you to join us in our efforts.",
    "contact": ["ASL@lions.molloy.edu"]

  },

  "AnimeClub": {
    "name": "Anime Club",
    "description": "<strong>Meetings: Tuesdays at 3:30PM in the Public Square Simulation Room</strong><br><br>The Anime Club at Molloy College is devoted to the friendly exchange of knowledge about Japan, Anime, Manga, Comics, Videogames and the Internet, as well as the culture surrounding it. From watching anime episodes, to playing hit videogame classics, to discussing all the latest news within the realm of fandom, the Anime Club is open to anyone and everyone that shares a passion for anime, manga, comics, games and Japanese culture.<br><br>Founded in September 2012, the Molloy College Anime Club is Molloy's one-stop spot for anything and everything Anime, Manga, Gaming, and general J-Culture. Meetings are usually spent watching and discussing anime, having mini in-club gaming tournaments, and playing various card games. We also have a community of TCG players that play while in club, as well as a large number of 3DS players, so come have a spotpass and maybe a Pokemon Battle or two. Annual events feature attending New York Comic Con in the fall, as well as the Brooklyn Botanical Gardens Sakura Matsuri in the Spring. We also have random hang-out weekends in the city, stopping at Kinokuniya, Karaoke, Midtown Comics, and various other places anime fans would stop. Come check us out, we are a passionate community of fans that is always open. Link to the Anime Club's official website:<a href=\"http://animemolloy.webs.com\">http://animemolloy.webs.com</a>",
    "contact": ["anime@lions.molloy.edu","mschultz@lions.molloy.edu"]

  },

  "BiologyClub": {
    "name": "Biology Club",
    "description":" The Biology Club intends to spark an interest in biology outside of the classroom through social interactions in an enjoyable atmosphere. The club wishes to host field trips to museums and other biology exhibits as well as to sponsor guest speakers in the field of biology and other sciences. The club will encourage the advancement of science through a monthly newsletter featuring published articles regarding current research. Lastly, the club will host demonstrations of various laboratory experiments to further expand the entire Molloy community’s knowledge of the subject matter.",
    "contact": ["NFernandez@lions.molloy.edu"]

  },

  "BreakTheSilenceClub": {
    "name":"Break the Silence Club",
    "description": "The purpose of this organization is to end the silence associated with relationship violence through education, training, and responsible action.<br><br>Our goals are to raise awareness, stimulate discussion and education related to relationship violence and its consequences, to develop a safe environment for communication, disclosure, and referral of relationship violence, and to develop peer-support mentoring and educational program.",
    "contact": ["taprigliano@molloy.edu"]

  },

  "BusinessAndAccountingClub": {
    "name":"Business and Accounting Club",
    "description":"The Business and Accounting Club will assist students in communicating the practice of professional management to Molloy and its community. Through research, discussion, publications and other appropriate means - to conduct and promote, study and understand the social, psychological and economic implications of scientific principles of modern management, accounting and economics.<br><br>The Business and Accounting Club is an organization that provides students with an opportunity to participate in a dynamic business minded atmosphere. In this environment students are pushed to go beyond their previous limits to reach new levels in the areas of communication, research and study. Some of the very best lessons cannot be taught out of a textbook, therefore the Business and Accounting Club incorporates real world activities to create a well-rounded area of focus. Our club spends time hosting events for its members, student body, as well as reaching out to the community through service hours. Molloy College has students of all disciplines and our club desires to reach out to the rest of the student body. We hope that students of all majors and interests would give our club a chance to enhance their knowledge about business and all its aspects. More importantly, our club acts as a network that each member can call upon for assistance with coursework, find partners for a project/business venture or simply ask questions about Molloy.",
    "contact": ["BAClub@lions.molloy.edu"]

  },

  "CareerInSportsClub": {
    "name":"Career in Sports Club",
    "description":"Designed to educate members about the many different job opportunities in sports by learning from professionals in various industries. We also stress the importance of attaining internships and will help members apply. Field trip possibilities.<br><br>The goal of the Career in Sports Club is for members to learn first-hand from accredited sports professionals. We will invite those that hold various positions within the industry to speak to the club about what they do. There will be a Question and Answer session following each guest speaker. Another goal of the Club is to bring club members to team facilities (front offices, stadiums, and other miscellaneous events) where they can observe how organizations function in day to day operations. Such guests may include but are not limited to: Professional athletes, General Managers, Vice Presidents, Marketing, Game Day Operations, Agents, Sports Medicine, and CEO’s of Radio and Sport Applications.",
    "contact": []

  },

  "AmericanRedCrossClub": {
    "name":,
    "description":,
    "contact": []

  },

  "AmericanRedCrossClub": {
    "name":,
    "description":,
    "contact": []

  },

  "AmericanRedCrossClub": {
    "name":,
    "description":,
    "contact": []

  },

  "AmericanRedCrossClub": {
    "name":,
    "description":,
    "contact": []

  },

  "AmericanRedCrossClub": {
    "name":,
    "description":,
    "contact": []

  },

  "AmericanRedCrossClub": {
    "name":,
    "description":,
    "contact": []

  },

  "AmericanRedCrossClub": {
    "name":,
    "description":,
    "contact": []

  },

  "AmericanRedCrossClub": {
    "name":,
    "description":,
    "contact": []

  },

  "AmericanRedCrossClub": {
    "name":,
    "description":,
    "contact": []

  },

  "AmericanRedCrossClub": {
    "name":,
    "description":,
    "contact": []

  },

  "AmericanRedCrossClub": {
    "name":,
    "description":,
    "contact": []

  },

  "AmericanRedCrossClub": {
    "name":,
    "description":,
    "contact": []

  },

  "AmericanRedCrossClub": {
    "name":,
    "description":,
    "contact": []

  },

  "AmericanRedCrossClub": {
    "name":,
    "description":,
    "contact": []

  },

  "AmericanRedCrossClub": {
    "name":,
    "description":,
    "contact": []

  },

  "AmericanRedCrossClub": {
    "name":,
    "description":,
    "contact": []

  },

  "AmericanRedCrossClub": {
    "name":,
    "description":,
    "contact": []

  },

  "AmericanRedCrossClub": {
    "name":,
    "description":,
    "contact": []

  },

  "AmericanRedCrossClub": {
    "name":,
    "description":,
    "contact": []

  },

  "AmericanRedCrossClub": {
    "name":,
    "description":,
    "contact": []

  },

  "AmericanRedCrossClub": {
    "name":,
    "description":,
    "contact": []

  },

  "AmericanRedCrossClub": {
    "name":,
    "description":,
    "contact": []

  },

  "AmericanRedCrossClub": {
    "name":,
    "description":,
    "contact": []

  },

  "AmericanRedCrossClub": {
    "name":,
    "description":,
    "contact": []

  },

}